In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

data_frame = DataFrame({
    'name': ['John', 'Edward', 'Smith', 'Obama', 'Polly'],
    'age': np.arange(18, 23),
})

data_frame

   age    name
0   18    John
1   19  Edward
2   20   Smith
3   21   Obama
4   22   Polly

In [3]:
# 我们现在有一个字典存储了学生对应的学习成绩
score = {
    'John': 89,
    'Edward': 98,
    'Smith': 85,
    'Bush': '83',
    'Obama': 78,
    'Polly': 67,
    'Donald': 77
}

# 现在我们想在data_frame中增加一列分数
data_frame['score'] = data_frame['name'].map(score)
data_frame

   age    name score
0   18    John    89
1   19  Edward    98
2   20   Smith    85
3   21   Obama    78
4   22   Polly    67